In [1]:
%load_ext sql

/Users/kylelee/anaconda/lib/python2.7/site-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated since IPython 4.0. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
/Users/kylelee/anaconda/lib/python2.7/site-packages/IPython/utils/traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

In [2]:
%sql sqlite:///sample1db.db

u'Connected: None@sample1db.db'

In [3]:
%sql select * from dept;

Done.

[(1, u'\uc601\uc5c5', 8),
 (2, u'\uae30\ud68d', 10),
 (3, u'\uac1c\ubc1c', 9),
 (4, u'\ucd1d\ubd80', 7)]

In [4]:
%sql select * from emp;

Done.

[(4377, u'\uc774\uc131\ub798', u'\uc0ac\uc7a5', None, 5000000, 2),
 (3426, u'\ubc15\uc601\uad8c', u'\uacfc\uc7a5', 4377, 3000000, 1),
 (3011, u'\uc774\uc218\ubbfc', u'\ubd80\uc7a5', 4377, 4000000, 3),
 (3427, u'\ucd5c\uc885\ucca0', u'\uc0ac\uc6d0', 3011, 1500000, 3),
 (1003, u'\uc870\ubbfc\ud76c', u'\uacfc\uc7a5', 4377, 3000000, 2),
 (2106, u'\uae40\ucc3d\uc12d', u'\ub300\ub9ac', 1003, 2500000, 2),
 (1365, u'\uae40\uc0c1\uc6d0', u'\uc0ac\uc6d0', 3426, 1500000, 1)]

In [2]:
%sql sqlite:///sample2db.db

u'Connected: None@sample2db.db'

In [4]:
%%sql
select * from student;

Done.

[(100, u'JONES', u'HISTORY', u'GR', 21),
 (150, u'PARKS', u'ACCOUNTING', u'SO', 19),
 (200, u'BAKER', u'MATH', u'GR', 50),
 (250, u'GLASS', u'HISTORY', u'SN', 50),
 (300, u'BAKER', u'ACCOUNTING', u'SN', 41),
 (350, u'RUSSEL', u'MATH', u'JR', 20),
 (400, u'RYE', u'ACCOUNTING', u'FR', 18),
 (450, u'JONES', u'HISTORY', u'SN', 24)]

In [6]:

%sql select * from class;

Done.

[(u'BA200', u'M-F9', u'SC110'),
 (u'BD445', u'MWF3', u'SC213'),
 (u'BF410', u'MWF8', u'SC213'),
 (u'CS150', u'MWF3', u'EA304'),
 (u'CS250', u'MWF12', u'EB210')]

In [7]:
%%sql
select * from enrollment;

Done.

[(100, u'BD445', 1),
 (150, u'BA200', 1),
 (200, u'BD445', 2),
 (200, u'CS250', 1),
 (300, u'CS150', 1),
 (400, u'BA200', 2),
 (400, u'BF410', 1),
 (400, u'CS250', 2),
 (450, u'BA200', 3)]